# Reshaping and Pivoting in Pandas
Wide Vs Long Format

wide format : each variable has its own cloumn
long format : variables are stores in a single column with multiple rows

pivot() -> converts long --> wide format
Syntax:-
DataFrame.pivot(index,col,values)

In [3]:
import pandas as pd

data = pd.DataFrame({"DATE" : ["03-03-2025" , "04-04-2025" , "05-05-2025" ," 06-06-2025"] ,
                     "Name" : ["kunal" , "varad" , "rohan" , "sanket"] , 
                     "Sal" : [1000000,20000,30000,40000]})

In [5]:
print(data)

          DATE    Name      Sal
0   03-03-2025   kunal  1000000
1   04-04-2025   varad    20000
2   05-05-2025   rohan    30000
3   06-06-2025  sanket    40000

In [15]:
data.pivot(index = "DATE" , columns = "Sal" , values = "Name")

Sal         20000   30000   40000   1000000
DATE
 06-06-2025     NaN     NaN  sanket     NaN
03-03-2025      NaN     NaN     NaN   kunal
04-04-2025    varad     NaN     NaN     NaN
05-05-2025      NaN   rohan     NaN     NaN

In [13]:
print(data)

          DATE    Name      Sal
0   03-03-2025   kunal  1000000
1   04-04-2025   varad    20000
2   05-05-2025   rohan    30000
3   06-06-2025  sanket    40000

In [19]:
data.pivot_table(index = "DATE" , columns = "Name" , values = "Sal" , aggfunc = "mean")

Name             kunal    rohan   sanket    varad
DATE
 06-06-2025        NaN      NaN  40000.0      NaN
03-03-2025   1000000.0      NaN      NaN      NaN
04-04-2025         NaN      NaN      NaN  20000.0
05-05-2025         NaN  30000.0      NaN      NaN

In [21]:
# stack()
data.stack() # convert column in row format

0  DATE     03-03-2025
   Name          kunal
   Sal         1000000
1  DATE     04-04-2025
   Name          varad
   Sal           20000
2  DATE     05-05-2025
   Name          rohan
   Sal           30000
3  DATE     06-06-2025
   Name         sanket
   Sal           40000
dtype: object

In [23]:
# unstack()
data.unstack()

DATE  0     03-03-2025
      1     04-04-2025
      2     05-05-2025
      3     06-06-2025
Name  0          kunal
      1          varad
      2          rohan
      3         sanket
Sal   0        1000000
      1          20000
      2          30000
      3          40000
dtype: object